In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('email_table.csv')

In [3]:
df1.head()

,email_id,email_text,email_version,hour,weekday,user_country,user_past_purchases
0,85120,short_email,personalized,2,Sunday,US,5
1,966622,long_email,personalized,12,Sunday,UK,2
2,777221,long_email,personalized,11,Wednesday,US,2
3,493711,short_email,generic,6,Monday,UK,1
4,106887,long_email,generic,14,Monday,US,6

In [4]:
df1.tail()

,email_id,email_text,email_version,hour,weekday,user_country,user_past_purchases
99995,803504,short_email,personalized,4,Monday,US,5
99996,899722,long_email,personalized,7,Saturday,US,1
99997,449610,long_email,personalized,11,Saturday,UK,6
99998,72497,short_email,generic,10,Monday,UK,0
99999,348333,long_email,personalized,8,Sunday,UK,1

In [5]:
df1.describe()

            email_id           hour  user_past_purchases
count  100000.000000  100000.000000         100000.00000
mean   498690.196160       9.059300              3.87845
std    289230.727534       4.439637              3.19611
min         8.000000       1.000000              0.00000
25%    246708.250000       6.000000              1.00000
50%    498447.000000       9.000000              3.00000
75%    749942.750000      12.000000              6.00000
max    999998.000000      24.000000             22.00000

In [6]:
df1.dtypes

email_id                int64
email_text             object
email_version          object
hour                    int64
weekday                object
user_country           object
user_past_purchases     int64
dtype: object

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   email_id             100000 non-null  int64
 1   email_text           100000 non-null  object
 2   email_version        100000 non-null  object
 3   hour                 100000 non-null  int64
 4   weekday              100000 non-null  object
 5   user_country         100000 non-null  object
 6   user_past_purchases  100000 non-null  int64
dtypes: int64(3), object(4)
memory usage: 5.3+ MB

In [8]:
df1.isnull().sum()

email_id               0
email_text             0
email_version          0
hour                   0
weekday                0
user_country           0
user_past_purchases    0
dtype: int64

In [9]:
df1.duplicated().sum()

0

In [11]:
df1.shape

(100000, 7)

In [13]:
grouped = df1.groupby('user_past_purchases')

In [14]:
trial1 = grouped['user_past_purchases'].agg(['mean', 'sum', 'count', 'min', 'max'])
print(trial1)

                     mean    sum  count  min  max
user_past_purchases
0                     0.0      0  13877    0    0
1                     1.0  13751  13751    1    1
2                     2.0  26072  13036    2    2
3                     3.0  36231  12077    3    3
4                     4.0  42972  10743    4    4
5                     5.0  45210   9042    5    5
6                     6.0  45108   7518    6    6
7                     7.0  42357   6051    7    7
8                     8.0  35144   4393    8    8
9                     9.0  29664   3296    9    9
10                   10.0  23630   2363   10   10
11                   11.0  17083   1553   11   11
12                   12.0  11328    944   12   12
13                   13.0   7514    578   13   13
14                   14.0   5068    362   14   14
15                   15.0   2820    188   15   15
16                   16.0   1632    102   16   16
17                   17.0   1020     60   17   17
18                   18.0    630     35   18   18
19                   19.0    285     15   19   19
20                   20.0    220     11   20   20
21                   21.0     84      4   21   21
22                   22.0     22      1   22   22

In [17]:
grouped = df1.groupby('email_id')
trial2 = grouped['email_id'].agg(['mean', 'sum', 'count', 'min', 'max'])
print(trial2)

              mean     sum  count     min     max
email_id
8              8.0       8      1       8       8
33            33.0      33      1      33      33
46            46.0      46      1      46      46
49            49.0      49      1      49      49
65            65.0      65      1      65      65
...            ...     ...    ...     ...     ...
999969    999969.0  999969      1  999969  999969
999972    999972.0  999972      1  999972  999972
999976    999976.0  999976      1  999976  999976
999980    999980.0  999980      1  999980  999980
999998    999998.0  999998      1  999998  999998

[100000 rows x 5 columns]

In [18]:
grouped = df1.groupby('hour')
trial3 = grouped['hour'].agg(['mean', 'sum', 'count', 'min', 'max'])
print(trial3)

      mean    sum  count  min  max
hour
1      1.0   2703   2703    1    1
2      2.0   7352   3676    2    2
3      3.0  13830   4610    3    3
4      4.0  22488   5622    4    4
5      5.0  32755   6551    5    5
6      6.0  44790   7465    6    6
7      7.0  57428   8204    7    7
8      8.0  67184   8398    8    8
9      9.0  76761   8529    9    9
10    10.0  81800   8180   10   10
11    11.0  82313   7483   11   11
12    12.0  78096   6508   12   12
13    13.0  72553   5581   13   13
14    14.0  64120   4580   14   14
15    15.0  52395   3493   15   15
16    16.0  44144   2759   16   16
17    17.0  32181   1893   17   17
18    18.0  25578   1421   18   18
19    19.0  17195    905   19   19
20    20.0  13120    656   20   20
21    21.0   7665    365   21   21
22    22.0   4488    204   22   22
23    23.0   3335    145   23   23
24    24.0   1656     69   24   24

In [19]:
df1.isnull().sum()

email_id               0
email_text             0
email_version          0
hour                   0
weekday                0
user_country           0
user_past_purchases    0
dtype: int64

In [20]:
df1.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
99995    False
99996    False
99997    False
99998    False
99999    False
Length: 100000, dtype: bool

In [24]:
df1.nunique().sum()

100062

In [25]:
df2 = pd.read_csv('email_opened_table.csv')

In [26]:
df2.head()

   email_id
0    284534
1    609056
2    220820
3    905936
4    164034

In [27]:
df2.tail()

       email_id
10340    990213
10341    918210
10342    200299
10343    211104
10344    320631

In [29]:
df2.isnull().sum()

email_id    0
dtype: int64

In [30]:
df2.duplicated().sum()

0

In [31]:
df2.describe()

            email_id
count   10345.000000
mean   499067.179604
std    289531.750750
min        49.000000
25%    247395.000000
50%    499261.000000
75%    752779.000000
max    999920.000000

In [35]:
df2.dtypes

email_id    int64
dtype: object

In [36]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10345 entries, 0 to 10344
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   email_id  10345 non-null  int64
dtypes: int64(1)
memory usage: 80.9 KB

In [37]:
df2.isnull()

       email_id
0         False
1         False
2         False
3         False
4         False
...         ...
10340     False
10341     False
10342     False
10343     False
10344     False

[10345 rows x 1 columns]

In [47]:
grouped = df1.groupby('email_id')
trial4 = grouped['email_id'].agg(['mean', 'sum', 'count', 'min', 'max'])
print(trial4)

              mean     sum  count     min     max
email_id
8              8.0       8      1       8       8
33            33.0      33      1      33      33
46            46.0      46      1      46      46
49            49.0      49      1      49      49
65            65.0      65      1      65      65
...            ...     ...    ...     ...     ...
999969    999969.0  999969      1  999969  999969
999972    999972.0  999972      1  999972  999972
999976    999976.0  999976      1  999976  999976
999980    999980.0  999980      1  999980  999980
999998    999998.0  999998      1  999998  999998

[100000 rows x 5 columns]

In [39]:
df3 = pd.read_csv('link_clicked_table.csv')

In [ ]:

df3.tail()
df3.info()
df3.describe()
df3.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2119 entries, 0 to 2118
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   email_id  2119 non-null   int64
dtypes: int64(1)
memory usage: 16.7 KB

email_id    int64
dtype: object

In [41]:
df3.describe()

            email_id
count    2119.000000
mean   496335.084474
std    292863.020634
min       257.000000
25%    238548.500000
50%    488927.000000
75%    757207.000000
max    999920.000000

In [42]:
df3.head()

   email_id
0    609056
1    870980
2    935124
3    158501
4    177561

In [43]:
df3.tail()

      email_id
2114    873162
2115    435454
2116    206772
2117    742967
2118    916564

In [44]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2119 entries, 0 to 2118
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   email_id  2119 non-null   int64
dtypes: int64(1)
memory usage: 16.7 KB

In [45]:
df3.isnull().sum()

email_id    0
dtype: int64

In [46]:
df3.duplicated().sum()

0

In [48]:
grouped = df1.groupby('email_id')
trial5 = grouped['email_id'].agg(['mean', 'sum', 'count', 'min', 'max'])
print(trial5)

              mean     sum  count     min     max
email_id
8              8.0       8      1       8       8
33            33.0      33      1      33      33
46            46.0      46      1      46      46
49            49.0      49      1      49      49
65            65.0      65      1      65      65
...            ...     ...    ...     ...     ...
999969    999969.0  999969      1  999969  999969
999972    999972.0  999972      1  999972  999972
999976    999976.0  999976      1  999976  999976
999980    999980.0  999980      1  999980  999980
999998    999998.0  999998      1  999998  999998

[100000 rows x 5 columns]

In [49]:
df3.nunique().sum()

2119

In [51]:
df3.shape

(2119, 1)

In [52]:
df2.shape

(10345, 1)

In [53]:
df3.value_counts()

email_id
257         1
661485      1
670865      1
670629      1
670592      1
           ..
322893      1
322753      1
322592      1
322352      1
999920      1
Name: count, Length: 2119, dtype: int64

In [54]:
df2.value_counts()

email_id
49          1
661333      1
663324      1
663331      1
663513      1
           ..
331616      1
331639      1
331694      1
331953      1
999920      1
Name: count, Length: 10345, dtype: int64

In [55]:
df1.value_counts()

email_id  email_text   email_version  hour  weekday    user_country  user_past_purchases
8         short_email  generic        9     Thursday   US            3                      1
665653    short_email  personalized   12    Sunday     US            0                      1
665955    long_email   generic        11    Thursday   US            2                      1
665948    long_email   generic        5     Saturday   UK            1                      1
665936    short_email  personalized   14    Saturday   UK            6                      1
                                                                                           ..
331163    long_email   personalized   1     Sunday     US            1                      1
331139    short_email  generic        10    Saturday   US            2                      1
331133    long_email   personalized   14    Wednesday  US            10                     1
331128    long_email   generic        9     Monday     FR            9                      1
999998    long_email   generic        16    Friday     FR            0                      1
Name: count, Length: 100000, dtype: int64